In [1]:
%load_ext sql

In [2]:
%sql sqlite:///./test.db

'Connected: @./test.db'

In [5]:
%%sql
Drop table if exists sales1;
Create Table Sales1
(
Id int,
Product Varchar(20),
Sales Bigint
);

 * sqlite:///./test.db
Done.
Done.

[]

In [6]:
%%sql

Insert into Sales1 values
(1001,'Keyboard',20)
,(1002,'Keyboard',25)
,(1003,'Laptop',30)
,(1004,'Laptop',35)
,(1005,'Laptop',40)
,(1006,'Monitor',45)
,(1007,'WebCam',50)
,(1008,'WebCam',55)

 * sqlite:///./test.db
8 rows affected.

[]

In [7]:
%sql select * from sales1

 * sqlite:///./test.db
Done.

[(1001, 'Keyboard', 20),
 (1002, 'Keyboard', 25),
 (1003, 'Laptop', 30),
 (1004, 'Laptop', 35),
 (1005, 'Laptop', 40),
 (1006, 'Monitor', 45),
 (1007, 'WebCam', 50),
 (1008, 'WebCam', 55)]

In [9]:
%sql select id,product,min(sales) over(partition by product) sales_1 from sales1;

 * sqlite:///./test.db
Done.

[(1001, 'Keyboard', 20),
 (1002, 'Keyboard', 20),
 (1003, 'Laptop', 30),
 (1004, 'Laptop', 30),
 (1005, 'Laptop', 30),
 (1006, 'Monitor', 45),
 (1007, 'WebCam', 50),
 (1008, 'WebCam', 50)]

In [21]:
%%sql select id,product,sum(sales) 
over(partition by product 
     order by id
     -- rows between unbounded preceding and current row
     ) sales_2 from sales1;

 * sqlite:///./test.db
Done.

[(1001, 'Keyboard', 20),
 (1002, 'Keyboard', 45),
 (1003, 'Laptop', 30),
 (1004, 'Laptop', 65),
 (1005, 'Laptop', 105),
 (1006, 'Monitor', 45),
 (1007, 'WebCam', 50),
 (1008, 'WebCam', 105)]